export const effects = {
  ノーマル: {
    かくとう: "効果ばつぐん",
    ゴースト: "無効",
    はがね: "効果いまひとつ"
  },
  ほのお: {
    くさ: "効果ばつぐん",
    こおり: "効果ばつぐん",
    むし: "効果ばつぐん",
    はがね: "効果ばつぐん",
    ほのお: "効果いまひとつ",
    みず: "効果いまひとつ",
    いわ: "効果いまひとつ",
    ドラゴン: "効果いまひとつ"
  },
  みず: {
    ほのお: "効果ばつぐん",
    じめん: "効果ばつぐん",
    いわ: "効果ばつぐん",
    みず: "効果いまひとつ",
    くさ: "効果いまひとつ",
    ドラゴン: "効果いまひとつ"
  },
  でんき: {
    みず: "効果ばつぐん",
    ひこう: "効果ばつぐん",
    でんき: "効果いまひとつ",
    くさ: "効果いまひとつ",
    ドラゴン: "効果いまひとつ",
    じめん: "無効"
  },
  くさ: {
    みず: "効果ばつぐん",
    じめん: "効果ばつぐん",
    いわ: "効果ばつぐん",
    くさ: "効果いまひとつ",
    ほのお: "効果いまひとつ",
    どく: "効果いまひとつ",
    ひこう: "効果いまひとつ",
    むし: "効果いまひとつ",
    ドラゴン: "効果いまひとつ",
    はがね: "効果いまひとつ"
  },
  こおり: {
    くさ: "効果ばつぐん",
    じめん: "効果ばつぐん",
    ひこう: "効果ばつぐん",
    ドラゴン: "効果ばつぐん",
    ほのお: "効果いまひとつ",
    みず: "効果いまひとつ",
    こおり: "効果いまひとつ",
    はがね: "効果いまひとつ"
  },
  かくとう: {
    ノーマル: "効果ばつぐん",
    こおり: "効果ばつぐん",
    いわ: "効果ばつぐん",
    あく: "効果ばつぐん",
    はがね: "効果ばつぐん",
    どく: "効果いまひとつ",
    ひこう: "効果いまひとつ",
    エスパー: "効果いまひとつ",
    むし: "効果いまひとつ",
    フェアリー: "効果いまひとつ",
    ゴースト: "無効"
  },
  どく: {
    くさ: "効果ばつぐん",
    フェアリー: "効果ばつぐん",
    どく: "効果いまひとつ",
    じめん: "効果いまひとつ",
    いわ: "効果いまひとつ",
    ゴースト: "効果いまひとつ",
    はがね: "無効"
  },
  じめん: {
    ほのお: "効果ばつぐん",
    でんき: "効果ばつぐん",
    いわ: "効果ばつぐん",
    じめん: "効果いまひとつ",
    くさ: "効果いまひとつ",
    こおり: "効果いまひとつ",
    はがね: "効果いまひとつ"
  },
  ひこう: {
    くさ: "効果ばつぐん",
    かくとう: "効果ばつぐん",
    どく: "効果ばつぐん",
    ひこう: "効果いまひとつ",
    いわ: "効果いまひとつ",
    エスパー: "効果いまひとつ",
    ドラゴン: "効果いまひとつ",
    あく: "効果いまひとつ",
    フェアリー: "効果いまひとつ"
  },
  エスパー: {
    かくとう: "効果ばつぐん",
    どく: "効果ばつぐん",
    エスパー: "効果いまひとつ",
    あく: "効果いまひとつ",
    ドラゴン: "効果いまひとつ",
    ゴースト: "効果いまひとつ",
    はがね: "効果いまひとつ"
  },
  むし: {
    くさ: "効果ばつぐん",
    あく: "効果ばつぐん",
    エスパー: "効果ばつぐん",
    ほのお: "効果いまひとつ",
    みず: "効果いまひとつ",
    でんき: "効果いまひとつ",
    いわ: "効果いまひとつ",
    ゴースト: "効果いまひとつ",
    ドラゴン: "効果いまひとつ",
    フェアリー: "効果いまひとつ"
  },
  いわ: {
    ほのお: "効果ばつぐん",
    ひこう: "効果ばつぐん",
    いわ: "効果いまひとつ",
    かくとう: "効果いまひとつ",
    じめん: "効果いまひとつ",
    みず: "効果いまひとつ",
    でんき: "効果いまひとつ",
    ドラゴン: "効果いまひとつ",
    あく: "効果いまひとつ",
    フェアリー: "効果いまひとつ"
  },
  ゴースト: {
    かくとう: "効果いまひとつ",
    ゴースト: "効果いまひとつ",
    あく: "効果ばつぐん",
    ドラゴン: "効果いまひとつ",
    フェアリー: "効果いまひとつ"
  },
  ドラゴン: {
    ほのお: "効果ばつぐん",
    みず: "効果ばつぐん",
    でんき: "効果ばつぐん",
    ドラゴン: "効果ばつぐん",
    あく: "効果いまひとつ",
    フェアリー: "効果いまひとつ"
  },
  あく: {
    かくとう: "効果いまひとつ",
    ゴースト: "効果ばつぐん",
    ドラゴン: "効果いまひとつ",
    あく: "効果いまひとつ",
    フェアリー: "効果いまひとつ"
  },
  はがね: {
    ほのお: "効果いまひとつ",
    みず: "効果いまひとつ",
    でんき: "効果いまひとつ",
    くさ: "効果いまひとつ",
    こおり: "効果いまひとつ",
    かくとう: "効果いまひとつ",
    どく: "効果いまひとつ",
    じめん: "効果いまひとつ",
    ひこう: "効果いまひとつ",
    エスパー: "効果いまひとつ",
    むし: "効果いまひとつ",
    いわ: "効果いまひとつ",
    ゴースト: "効果いまひとつ",
    ドラゴン: "効果いまひとつ",
    あく: "効果いまひとつ",
    フェアリー: "効果いまひとつ"
  },
  フェアリー: {
    かくとう: "効果ばつぐん",
    ドラゴン: "効果ばつぐん",
    あく: "効果ばつぐん",
    はがね: "効果いまひとつ",
    ほのお: "効果いまひとつ",
    みず: "効果いまひとつ",
    でんき: "効果いまひとつ",
    くさ: "効果いまひとつ",
    こおり: "効果いまひとつ",
    いわ: "効果いまひとつ",
    ゴースト: "効果いまひとつ",}
};

console.log(effects.でんき)